In [2]:
# 시리즈 : 1차원 배열 -> 인덱스와 값이 존재
import pandas as pd # pandas의 구조자료는 series와 dataframe이 존재

In [10]:
dist_data = {'a':1,'2':2,'c':3}
list_data = [1,2,3]

srd = pd.Series(dist_data)
srl = pd.Series(list_data)

print(type(dist_data),dist_data)
print(type(srd),'\n',srd)

print(type(list_data),list_data)
print(type(srl),'\n',srl)

<class 'dict'> {'a': 1, '2': 2, 'c': 3}
<class 'pandas.core.series.Series'>
 a    1
2    2
c    3
dtype: int64
<class 'list'> [1, 2, 3]
<class 'pandas.core.series.Series'>
 0    1
1    2
2    3
dtype: int64

In [15]:
# 인덱스 확인
print("srd.index", srd.index)
print("srl.index", srl.index)

# 시리즈의 값을 확인
print("srd.values", srd.values)
print("srl.values", srl.values)

srd.index Index(['a', '2', 'c'], dtype='object')
srl.index RangeIndex(start=0, stop=3, step=1)
srd.values [1 2 3]
srl.values [1 2 3]

In [22]:
# 각 자료의 원소 선택
sr_data = pd.Series(list(range(10)))
# srl[ idx_start : ids_end ] start 포함, end 포함하지 않음
sr_data[1:10]
srd['a']
sr_key = pd.Series({'a':1,'b':2,'c':3,'d':4})

In [27]:
print(sr_key[['a','b']]) 
print(sr_key[[0,2]]) 

print(sr_key['a':'c']) # c포함
print(sr_key[0:2]) # 2미포함

a    1
b    2
dtype: int64
a    1
c    3
dtype: int64
a    1
b    2
c    3
dtype: int64
a    1
b    2
dtype: int64

In [36]:
sr_list = pd.Series(list(range(5)), index=['a','b','c','d','x'])
sr_list
sr_list = pd.Series(list(range(10)), index=[x for x in 'abcdefghij'])

In [43]:
# 마지막 자료를 출력 : 인덱스명과 첨자 둘다
print(sr_list[-1], sr_list['j'])
# 1번째부터 3번째 까지의 자료 출력, 인덱스명으로도 출력
print(sr_list[1:4])
print("['b':'e']\n",sr_list['b':'e'])
# 인덱스명 'b'와 'd'의 값을 출력
print("[['b','d']]\n",sr_list[['b','d']])

9 9
b    1
c    2
d    3
dtype: int64
['b':'e']
 b    1
c    2
d    3
e    4
dtype: int64
[['b','d']]
 b    1
d    3
dtype: int64

In [46]:
# dataframe : 2차원, pandas.DataFrame(data(2차원) , [index= ],[columns= ])
# 딕셔너리 데이터프레임 생성
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9]}
df = pd.DataFrame(dict_data)
df

   c0  c1  c2
0   1   4   7
1   2   5   8
2   3   6   9

In [50]:
#dataframe -> index명과 cloumn명을 부여
df = pd.DataFrame([[15,'남','수리중'],[17,'여','덕명중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])
df

    나이 성별   학교
준서  15  남  수리중
예은  17  여  덕명중

In [ ]:
#새로운 행을 추가 df.loc['인덱스명'] = [값, ..]
df.loc['철수'] = ['17','남','덕명중']
df

In [69]:
# 인덱스 명을 변경 -> 행 인덱스, 열 이름
# 객체명.index = 새로운 인덱스명
# 객체명.column = 새로우 컬럼명
df.index = ['a', 'b', 'c']
df
df.columns = ['연령','남녀','소속']
df

# 일부 인덱스 명만 수정
# 객체명.rename(index={기존인덱스:새로운인덱스, ,,,})
# 객체명.rename{column={기존인덱스:새로운인덱스, ,,,})

# '남녀'를 '연령'으로 컬럼 변경, a ->'준서'로 변경
df.rename(index={'a':'준서'},columns={'남녀':'성별'}, inplace=True)
df

    연령 성별   소속
준서  15  남  수리중
b   17  여  덕명중
c   17  남  덕명중

In [74]:
# 행 삭제 -> 객체.drop(행인덱스 또는 배열. axis=0)
# 열 삭제 -> 객체.drop(열이름 또는 배열. axis=1)
df.drop('준서', axis=0)
df.drop('성별', axis=1) #이것도 적용시 inplace=True 필요

    연령   소속
준서  15  수리중
b   17  덕명중
c   17  덕명중

In [72]:
df

    연령 성별   소속
준서  15  남  수리중
b   17  여  덕명중
c   17  남  덕명중

In [75]:
# 이름을 키로 국어, 영어, 수학, 과학 점수를 값으로
# 입력 받아 리스트에 저장한 후
# 해당 자료를 데이터 프레임으로 전환 -> 인덱스 명은 이름으로

In [92]:
students = {}
def create_student():
    while True:
        name = input("이름 입력 > ")
        if name == 'q':
            break
        score = list(map(int, input('국어, 영어, 수학, 과학 점수 입력 > ').split()))
        students[name] = score

In [93]:
create_student()

이름 입력 > 박의찬
국어, 영어, 수학, 과학 점수 입력 > 30 50 70 40
이름 입력 > 의찬
국어, 영어, 수학, 과학 점수 입력 > 20 59 38 39
이름 입력 > q

In [112]:
df = pd.DataFrame(students)
df.index = ['국어', '영어', '수학','과학']
df = df.transpose()
df

     국어  영어  수학  과학
박의찬  30  50  70  40
의찬   20  59  38  39

In [111]:
df = pd.DataFrame.from_dict(students, orient='index')
df

      0   1   2   3
박의찬  30  50  70  40
의찬   20  59  38  39

In [113]:
df1 =df[:]
df1

     국어  영어  수학  과학
박의찬  30  50  70  40
의찬   20  59  38  39

In [115]:
a=[1,2,3,4]
b=a.copy()

In [122]:
# 데이터프레임 원소 선택
exam_data = {'수학':[90,49,48],'영어':[38,42,66],'음악':[37,22,62],'체육':[37,66,88]}
df_exam = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df_exam

    수학  영어  음악  체육
서준  90  38  37  37
우현  49  42  22  66
인아  48  66  62  88

In [124]:
# 행 인덱스(이름)를 사용하여 1개 행 선택('서준')
print(df_exam.loc['서준'])
# 행 인덱스(정수)를 사용하여 1개 행 선택(0행)
print(df_exam.iloc[0])

# 두개의 행 을 선택'서준','우현'
print(df_exam.loc[['서준','우현']])
print(df_exam.iloc[[0,1]]) 
print(df_exam.iloc[0:1]) #1은 포함 안함

수학    90
영어    38
음악    37
체육    37
Name: 서준, dtype: int64
수학    90
영어    38
음악    37
체육    37
Name: 서준, dtype: int64
    수학  영어  음악  체육
서준  90  38  37  37
우현  49  42  22  66
    수학  영어  음악  체육
서준  90  38  37  37
우현  49  42  22  66
    수학  영어  음악  체육
서준  90  38  37  37

In [129]:
#컬럼(열)을 선택: df.컬럼명 or df['컬럼명']
print(df_exam.수학, '\n', df_exam['영어'])
print(df_exam[ ['수학','음악'] ])

서준    90
우현    49
인아    48
Name: 수학, dtype: int64
 서준    38
우현    42
인아    66
Name: 영어, dtype: int64
    수학  음악
서준  90  37
우현  49  22
인아  48  62

In [132]:
#범위 슬라이싱 : 객체.iloc[start : end : step]
print(df_exam.iloc[0:3:1])
print(df_exam.iloc[::-1])
df_exam.iloc[::2]

    수학  영어  음악  체육
서준  90  38  37  37
우현  49  42  22  66
인아  48  66  62  88
    수학  영어  음악  체육
인아  48  66  62  88
우현  49  42  22  66
서준  90  38  37  37

    수학  영어  음악  체육
서준  90  38  37  37
인아  48  66  62  88

In [160]:
# 데이터프레임의 각 원소를 선택
# 인덱스 이름 : 데이터프레임 객체.loc[행 인덱스명,컬럼명]
# 정수 위치 인덱스 : 데이터프레임 객체.iloc[행번호,열번호]
# 서준의 영어 점수를 출력
print(df_exam.loc['서준','영어'], df_exam.iloc[0,1])
print()
#서준과 인아의 영어 음악 점수를 출력
print(df_exam.loc[['서준','인아'],['영어','음악']])
print()
#서준부터 인아까지  수학부터 음악까지 출력
print(df_exam.loc['서준':'인아','수학':'음악'])
print()
#서준의 수학과 체육 점수만 출력
print(df_exam.loc[['서준'],['수학','체육']]) # dataframe
print()
print(df_exam.loc['서준',['수학','체육']])   # series
df_exam

38 38

    영어  음악
서준  38  37
인아  66  62

    수학  영어  음악
서준  90  38  37
우현  49  42  22
인아  48  66  62

    수학  체육
서준  90  37

수학    90
체육    37
Name: 서준, dtype: int64

    수학  영어  음악  체육   국어
서준  90  38  37  37  100
우현  49  42  22  66   29
인아  48  66  62  88   49
철수  80  70  40  80   30

In [161]:
#철수 추가
#df_exam.loc['철수'] = [80,70,40,80]
#df_exam

In [162]:
# 새로운 열 추가
df_exam['국어'] = [100,29,49,30]
df_exam

    수학  영어  음악  체육   국어
서준  90  38  37  37  100
우현  49  42  22  66   29
인아  48  66  62  88   49
철수  80  70  40  80   30

In [167]:
# 기존의 행을 복사해서 추가
df_exam.loc['추가']=df_exam.loc['서준']
df_exam

    수학  영어  음악  체육   국어
서준  90  38  37  37  100
우현  49  42  22  66   29
인아  48  66  62  88   49
철수  80  70  40  80   30
추가  90  38  37  37  100

In [250]:
df = pd.DataFrame(columns=['kor','eng','math'])
df

Empty DataFrame
Columns: [kor, eng, math]
Index: []

In [251]:
#df_exam.loc['철수'] = [80,70,40,80]
def Create_score():
    while True:
        name = input("이름 입력 > ")
        if name == 'q':
            break
        score = list(map(int, input("국어 영어 수학 점수 입력 > ").split()))
        # if len(score) != 3 or score.isdigit
        df.loc[name] = score[:]

In [252]:
def Search_score():
    while True:
        search = input("검색할 이름 입력 > ")
        if search == 'q':
            break
        if search in df.index:
            print(df.loc[search])
        else:
            print("자료 없음")

In [253]:
def Search_title():
     while True:
        search = input("검색할 이름과 과목을 입력 > ").split()
        if search[0] == 'q':
            break
        if search[0] in df.index:
            if search[1] in df.columns:
                print("검색한 ",search[0],"의 ",search[1],"성적은 ",df.loc[search[0],search[1]],"입니다.")
            else:
                print("과목 자료 없음")
        else:
            print("이름 자료 없음")

In [254]:
def Add_score():
    while True:
        name = input("추가할 이름 입력 > ")
        if name == 'q':
            break
        score = list(map(int, input("국어 영어 수학 점수 입력 > ").split()))
        df.loc[name] = score[:]
        print(df)

In [255]:
Create_score()
Search_score()
Search_title()
Add_score()
df

이름 입력 > 박의찬
국어 영어 수학 점수 입력 > 30 50 20
이름 입력 > q
검색할 이름 입력 > 으찬
자료 없음
검색할 이름 입력 > 박의찬
kor     30
eng     50
math    20
Name: 박의찬, dtype: object
검색할 이름 입력 > q
검색할 이름과 과목을 입력 > 의찬 math
이름 자료 없음
검색할 이름과 과목을 입력 > 박의찬 fff
과목 자료 없음
검색할 이름과 과목을 입력 > 박의찬 math
검색한  박의찬 의  math 성적은  20 입니다.
검색할 이름과 과목을 입력 > q
추가할 이름 입력 > 송석현
국어 영어 수학 점수 입력 > 40 50 30
    kor eng math
박의찬  30  50   20
송석현  40  50   30
추가할 이름 입력 > q

    kor eng math
박의찬  30  50   20
송석현  40  50   30

In [257]:
df

    kor eng math
박의찬  30  50   20
송석현  40  50   30

In [259]:
def Retouch():
     while True:
        search = input("수정할분의 이름과 과목을 입력 > ").split()
        if search[0] == 'q':
            break
        if search[0] in df.index:
            if search[1] in df.columns:
                print("수정할 ",search[0],"의 ",search[1],"성적은 ",df.loc[search[0],search[1]],"입니다.")
                score = int(input("새로운 점수를 입력하세요 > "))
                df.loc[search[0],search[1]] = score
            else:
                print("과목 자료 없음")
        else:
            print("이름 자료 없음")

In [261]:
Retouch()

수정할분의 이름과 과목을 입력 > 박의찬 math
수정할  박의찬 의  math 성적은  20 입니다.
새로운 점수를 입력하세요 > 100
수정할분의 이름과 과목을 입력 > q

In [262]:
df

    kor eng math
박의찬  30  50  100
송석현  40  50   30